// выводим в консоль числа от 1 до 10
let a = 1;
while (a <= 10) {
    console.log(a);
    a = a + 1;
}

// вывести в консоль все четные числа от 1 до 100
let e = 2;
while (e <= 100) {
    console.log(e);
    e = e + 2;
}

// вывести в консоль строку, содержащую все числа от 1 до 10 через запятую
let s = ``;
let b = 1;
while (b <= 10) {

    if (b < 10) {
        s = s + b + ", ";
    } else {
        s = s + b + ". ";
    }
    b = b + 1

}
console.log(s);

// вывести в консоль все значения синуса на интервале от -1 до 1 с шагом 0.1
// sin(0) = 1
let d = -1;
while (d <= 1) {
    const l = Math.sin(d);
    console.log(` sin (${d}) =  ${l}`);
    d = d + 0.1;
}